###############################################################
#  Generated by:      Cadence Innovus 17.13-s098_1
#  OS:                Linux x86_64(Host ID cadence212)
#  Generated on:      Sun Sep  8 10:38:22 2019
#  Design:            mtm_Alu
#  Command:           write_db ./RESULTS_PR/mtm_Alu_innovus
###############################################################
current_design mtm_Alu
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_max_fanout 1  [get_ports {clk}]
set_input_transition 0.2  [get_ports {clk}]
set_max_fanout 1  [get_ports {rst_n}]
set_input_transition 0.2  [get_ports {rst_n}]
set_max_fanout 1  [get_ports {sin}]
set_input_transition 0.2  [get_ports {sin}]
set_load -pin_load -max  0.1  [get_ports {sout}]
set_load -pin_load -min  0.1  [get_ports {sout}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {sin}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {sout}]
set_clock_uncertainty 0.1 -hold [get_clocks {clk}]
set_clock_uncertainty 0.3 -setup [get_clocks {clk}]
